Duet3D/Duet3Expansion/src/atmel/SAMD20_DFP/1.2.91/samd20b/atdf/ATSAMD20J16B.atdf
          <instance name="TC4">
            <register-group name="TC4" name-in-module="TC" address-space="base" offset="0x42003000"/>
            <signals>
              <signal group="WO" index="0" function="F" pad="PA22"/>
              <signal group="WO" index="0" function="F" pad="PB08"/>
              <signal group="WO" index="0" function="E" pad="PB12"/>
              <signal group="WO" index="1" function="F" pad="PA23"/>
              <signal group="WO" index="1" function="F" pad="PB09"/>
              <signal group="WO" index="1" function="E" pad="PB13"/>
            </signals>
            <parameters>
              <param name="CC8_NUM" value="2"/>
              <param name="CC16_NUM" value="2"/>
              <param name="CC32_NUM" value="2"/>
              <param name="DITHERING_EXT" value="0"/>
              <param name="GCLK_ID" value="21"/>
              <param name="MASTER" value="1"/>
              <param name="OW_NUM" value="2"/>
              <param name="PERIOD_EXT" value="0"/>
              <param name="SHADOW_EXT" value="0"/>
              <param name="INSTANCE_ID" value="76"/>
            </parameters>
          </instance>
          <instance name="TC5">
            <register-group name="TC5" name-in-module="TC" address-space="base" offset="0x42003400"/>
            <signals>
              <signal group="WO" index="0" function="F" pad="PA24"/>
              <signal group="WO" index="0" function="F" pad="PB10"/>
              <signal group="WO" index="0" function="E" pad="PB14"/>
              <signal group="WO" index="1" function="F" pad="PA25"/>
              <signal group="WO" index="1" function="F" pad="PB11"/>
              <signal group="WO" index="1" function="E" pad="PB15"/>
            </signals>
            <parameters>
              <param name="CC8_NUM" value="2"/>
              <param name="CC16_NUM" value="2"/>
              <param name="CC32_NUM" value="2"/>
              <param name="DITHERING_EXT" value="0"/>
              <param name="GCLK_ID" value="21"/>
              <param name="MASTER" value="0"/>
              <param name="OW_NUM" value="2"/>
              <param name="PERIOD_EXT" value="0"/>
              <param name="SHADOW_EXT" value="0"/>
              <param name="INSTANCE_ID" value="77"/>
            </parameters>
          </instance>
          <instance name="TC6">
            <register-group name="TC6" name-in-module="TC" address-space="base" offset="0x42003800"/>
            <signals>
              <signal group="WO" index="0" function="F" pad="PB02"/>
              <signal group="WO" index="0" function="E" pad="PB16"/>
              <signal group="WO" index="1" function="F" pad="PB03"/>
              <signal group="WO" index="1" function="E" pad="PB17"/>
            </signals>
            <parameters>
              <param name="CC8_NUM" value="2"/>
              <param name="CC16_NUM" value="2"/>
              <param name="CC32_NUM" value="2"/>
              <param name="DITHERING_EXT" value="0"/>
              <param name="GCLK_ID" value="22"/>
              <param name="MASTER" value="1"/>
              <param name="OW_NUM" value="2"/>
              <param name="PERIOD_EXT" value="0"/>
              <param name="SHADOW_EXT" value="0"/>
              <param name="INSTANCE_ID" value="78"/>
            </parameters>
          </instance>
          <instance name="TC7">
            <register-group name="TC7" name-in-module="TC" address-space="base" offset="0x42003C00"/>
            <signals>
              <signal group="WO" index="0" function="F" pad="PB00"/>
              <signal group="WO" index="0" function="F" pad="PB22"/>
              <signal group="WO" index="0" function="E" pad="PA20"/>
              <signal group="WO" index="1" function="F" pad="PB01"/>
              <signal group="WO" index="1" function="F" pad="PB23"/>
              <signal group="WO" index="1" function="E" pad="PA21"/>
            </signals>
            <parameters>
              <param name="CC8_NUM" value="2"/>
              <param name="CC16_NUM" value="2"/>
              <param name="CC32_NUM" value="2"/>
              <param name="DITHERING_EXT" value="0"/>
              <param name="GCLK_ID" value="22"/>
              <param name="MASTER" value="0"/>
              <param name="OW_NUM" value="2"/>
              <param name="PERIOD_EXT" value="0"/>
              <param name="SHADOW_EXT" value="0"/>
              <param name="INSTANCE_ID" value="79"/>
            </parameters>
          </instance>
        </module>
        <module name="WDT" id="U2203" version="2.0.0">
          <instance name="WDT">
            <register-group name="WDT" name-in-module="WDT" address-space="base" offset="0x40001000"/>
            <parameters>
              <param name="GCLK_ID" value="1"/>
              <param name="INSTANCE_ID" value="4"/>
            </parameters>
          </instance>
        </module>
      <module name="SystemControl">
          <instance name="SystemControl">
            <register-group address-space="base" offset="0xE000E000" name-in-module="SystemControl" name="SystemControl"/>
          </instance>
        </module><module name="SysTick">
          <instance name="SysTick">
            <register-group address-space="base" offset="0xE000E010" name-in-module="SysTick" name="SysTick"/>
          </instance>
        </module><module name="NVIC">
          <instance name="NVIC">
            <register-group address-space="base" offset="0xE000E100" name-in-module="NVIC" name="NVIC"/>
          </instance>
        </module></peripherals>
      <interrupts>
        <interrupt name="NonMaskableInt" index="-14" caption="Non Maskable Interrupt"/>
        <interrupt name="HardFault" index="-13" caption="Cortex-M0+ Hard Fault Interrupt"/>
        <interrupt name="SVCall" index="-5" caption="Cortex-M0+ SV Call Interrupt"/>
        <interrupt name="PendSV" index="-2" caption="Cortex-M0+ Pend SV Interrupt"/>
        <interrupt name="SysTick" index="-1" caption="Cortex-M0+ System Tick Interrupt"/>
        <interrupt name="PM" index="0" module-instance="PM"/>
        <interrupt name="SYSCTRL" index="1" module-instance="SYSCTRL"/>
        <interrupt name="WDT" index="2" module-instance="WDT"/>
        <interrupt name="RTC" index="3" module-instance="RTC"/>
        <interrupt name="EIC" index="4" module-instance="EIC"/>
        <interrupt name="NVMCTRL" index="5" module-instance="NVMCTRL"/>
        <interrupt name="EVSYS" index="6" module-instance="EVSYS"/>
        <interrupt name="SERCOM0" index="7" module-instance="SERCOM0"/>
        <interrupt name="SERCOM1" index="8" module-instance="SERCOM1"/>
        <interrupt name="SERCOM2" index="9" module-instance="SERCOM2"/>
        <interrupt name="SERCOM3" index="10" module-instance="SERCOM3"/>
        <interrupt name="SERCOM4" index="11" module-instance="SERCOM4"/>
        <interrupt name="SERCOM5" index="12" module-instance="SERCOM5"/>
        <interrupt name="TC0" index="13" module-instance="TC0"/>
        <interrupt name="TC1" index="14" module-instance="TC1"/>
        <interrupt name="TC2" index="15" module-instance="TC2"/>
        <interrupt name="TC3" index="16" module-instance="TC3"/>
        <interrupt name="TC4" index="17" module-instance="TC4"/>
        <interrupt name="TC5" index="18" module-instance="TC5"/>
        <interrupt name="TC6" index="19" module-instance="TC6"/>
        <interrupt name="TC7" index="20" module-instance="TC7"/>
        <interrupt name="ADC" index="21" module-instance="ADC"/>
        <interrupt name="AC" index="22" module-instance="AC"/>
        <interrupt name="DAC" index="23" module-instance="DAC"/>
        <interrupt name="PTC" index="24" module-instance="PTC"/>
      </interrupts>
      <interfaces>
        <interface name="SWD" type="swd"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="DSU_DID" value="0x10001602"/>
        </property-group>
      </property-groups>
    </device>
  </devices>
  <modules>
    <module name="AC" id="U2205" version="1.1.1" caption="Analog Comparators">
      <register-group name="AC" caption="Analog Comparators">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x4"/>
          <bitfield name="LPMUX" caption="Low-Power Mux" mask="0x80"/>
        </register>
